app/controllers/application_controller.rb

  def current_user
    User.find_by(id: @current_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]