app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 2]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @appointments = Appointment.where({user_id: current_user.id}).includes(:subject)

INSERT INTO "appointments" ("city", "date", "subject_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["city", "Moscow"], ["date", "2021-07-17 00:04:11.619000"], ["subject_id", 1], ["user_id", 1], ["created_at", "2021-07-17 00:04:16.338254"], ["updated_at", "2021-07-17 00:04:16.338254"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save