app/controllers/registrations_controller.rb

  def create
    err = ''
    begin
      user = User.create(user_params)
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"