app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: user_params['email'])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "oscaraa0aaxwa0aks0d0@mail.com"], ["LIMIT", 1]]